{
  "ticker": "RLI",
  "meta": {
    "company": "RLI Corp.",
    "shortName": "RLI Corp.",
    "longBusinessSummary": "RLI Corp., an insurance holding company, underwrites property, casualty, and surety insurance products. The Casualty segment provides commercial excess, personal umbrella, general liability, transportation, and management liability coverages; and package business and other specialty coverages, including professional liability and workers' compensation for office-based professionals. This segment also offers coverages for security guards and environmental liability for underground storage tanks, contractors and asbestos, and environmental remediation specialists; and professional liability coverages for errors and omission coverage for small to medium-sized design, technical, computer, and miscellaneous professionals. In addition, this segment provides commercial automobile liability and physical damage insurance to local, intermediate and long haul truckers, public transportation entities, and other types of specialty commercial automobile risks; incidental related insurance coverages; inland marine coverages; management liability coverages, such as directors and officers liability insurance, fiduciary liability and coverages, employment practice liability, and for various classes of risks, including public and private businesses; and home business insurance products. The Property segment offers commercial property coverage that consists of excess and surplus lines and specialty insurance, such as fire, earthquake, wind, difference in conditions, earthquake, flood, and collapse coverages; insurance for office buildings, apartments, condominiums, and industrial and mercantile structures. This segment also provides cargo, hull, protection and indemnity, marine liability, inland marine, homeowners' and dwelling fire, and other property insurance products. The Surety segment provides commercial surety bonds for medium and large-sized businesses; small bonds for businesses and individuals; and bonds for small to medium-sized contractors. The company offers reinsurance coverages. It markets its products through branch offices, wholesale and retail brokers, carrier partners, and underwriting and independent agents. RLI Corp. was incorporated in 1965 and is headquartered in Peoria, Illinois.",
    "sector": "Financial Services",
    "industry": "Insurance - Property & Casualty",
    "country": "United States",
    "address": "9025 North Lindbergh Drive",
    "phone": "309 692 1000",
    "website": "https://www.rlicorp.com",
    "employees": 1147
  },
  "summary": {
    "currency": "USD",
    "marketCap": 6222367744,
    "beta": 0.603,
    "price": {
      "current": 67.08,
      "open": 67.8,
      "high": 67.91,
      "low": 66.82,
      "prevClose": 67.76,
      "dayChangePercent": -0.0100354,
      "volume": 488229,
      "avgVolume3m": 597633,
      "fiftyTwoWeekHigh": 91.145,
      "fiftyTwoWeekLow": 65.14,
      "fiftyDayAverage": 68.645,
      "twoHundredDayAverage": 75.506424
    },
    "dividends": {
      "increasingYears": 14,
      "rate": 0.64,
      "yield": 0.0094,
      "payoutRatio": 0.1714,
      "exDate": "2025-08-29T00:00:00.000Z",
      "lastDividend": 0.16,
      "dgr3": 4.814946962807332,
      "dgr5": 4.609877084153968,
      "dgr10": null
    }
  },
  "statistics": {
    "sharesOutstanding": 91829504,
    "floatShares": 79724509,
    "insiderOwnership": 0.01541,
    "institutionalOwnership": 0.84639,
    "shortRatio": 2.89,
    "shortPercentFloat": 0.0272,
    "priceToBook": 3.5510855,
    "enterpriseValue": 6137063936,
    "enterpriseToRevenue": 3.378,
    "enterpriseToEbitda": 14.646,
    "trailingPE": null,
    "forwardPE": 21.317774,
    "trailingEPS": 3.47,
    "forwardEPS": 6.38,
    "bookValue": 18.89,
    "netIncomeToCommon": 323436992
  },
  "financials": {
    "revenue": 1816601984,
    "grossProfit": 538302016,
    "operatingIncome": null,
    "netIncome": 323436992,
    "ebitda": 419016000,
    "freeCashFlow": 368632512,
    "operatingCashFlow": 625681024,
    "totalCash": 137076000,
    "totalDebt": 114219000,
    "debtToEquity": 6.585,
    "returnOnAssets": 0.044660002,
    "returnOnEquity": 0.19488001,
    "grossMargin": 0.29632,
    "operatingMargin": 0.3109,
    "netMargin": 0.17805,
    "ebitdaMargin": 0.23066,
    "fcfMargin": 0.20292420422678564,
    "earningsGrowth": 0.506
  },
  "snapshots": [
    {
      "timestamp": "2025-09-06T03:01:51.073Z",
      "price": 67.08,
      "marketCap": 6222367744,
      "pe": 21.317774,
      "eps": 3.47,
      "dividendYield": 0.0094,
      "debtEquity": 6.585
    }
  ],
  "dividends": {},
  "updatedAt": "2025-09-06T03:01:51.096Z"
}